{"format": "graph-model", "generatedBy": "2.9.1", "convertedBy": "TensorFlow.js Converter v3.19.0", "signature": {"inputs": {"emis_abso_input": {"name": "emis_abso_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7"}]}}}, "outputs": {"lambda": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/emis_abso/normalization_1/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_9/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "7"}, {"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_9/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_10/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_10/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_11/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_11/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_12/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "1024"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_12/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_13/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_13/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_14/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_14/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_15/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_15/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_16/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_16/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_17/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_17/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/lambda/mul/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lambda/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lambda/mul_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lambda/add_1/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/lambda/pow/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "emis_abso_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "7"}]}}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/normalization_1/sub", "op": "Sub", "input": ["emis_abso_input", "unknown"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/normalization_1/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/emis_abso/normalization_1/sub", "ConstantFolding/StatefulPartitionedCall/sequential/emis_abso/normalization_1/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_9/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/emis_abso/normalization_1/truediv", "StatefulPartitionedCall/sequential/emis_abso/dense_9/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/emis_abso/dense_9/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_10/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/emis_abso/dense_9/Relu", "StatefulPartitionedCall/sequential/emis_abso/dense_10/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/emis_abso/dense_10/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_11/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/emis_abso/dense_10/Relu", "StatefulPartitionedCall/sequential/emis_abso/dense_11/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/emis_abso/dense_11/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_12/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/emis_abso/dense_11/Relu", "StatefulPartitionedCall/sequential/emis_abso/dense_12/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/emis_abso/dense_12/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_13/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/emis_abso/dense_12/Relu", "StatefulPartitionedCall/sequential/emis_abso/dense_13/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/emis_abso/dense_13/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_14/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/emis_abso/dense_13/Relu", "StatefulPartitionedCall/sequential/emis_abso/dense_14/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/emis_abso/dense_14/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_15/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/emis_abso/dense_14/Relu", "StatefulPartitionedCall/sequential/emis_abso/dense_15/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/emis_abso/dense_15/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_16/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/emis_abso/dense_15/Relu", "StatefulPartitionedCall/sequential/emis_abso/dense_16/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/emis_abso/dense_16/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_17/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential/emis_abso/dense_16/Relu", "StatefulPartitionedCall/sequential/emis_abso/dense_17/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential/emis_abso/dense_17/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential/lambda/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/emis_abso/dense_17/BiasAdd", "StatefulPartitionedCall/sequential/lambda/mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lambda/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/lambda/mul", "StatefulPartitionedCall/sequential/lambda/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lambda/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential/lambda/add", "StatefulPartitionedCall/sequential/lambda/mul_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lambda/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential/lambda/mul_1", "StatefulPartitionedCall/sequential/lambda/add_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/lambda/pow", "op": "Pow", "input": ["StatefulPartitionedCall/sequential/lambda/add_1", "StatefulPartitionedCall/sequential/lambda/pow/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential/lambda/pow"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1087}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "unknown", "shape": [7], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential/emis_abso/normalization_1/truediv_recip", "shape": [7], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_9/MatMul/ReadVariableOp", "shape": [7, 1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_9/BiasAdd/ReadVariableOp", "shape": [1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_10/MatMul/ReadVariableOp", "shape": [1024, 1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_10/BiasAdd/ReadVariableOp", "shape": [1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_11/MatMul/ReadVariableOp", "shape": [1024, 1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_11/BiasAdd/ReadVariableOp", "shape": [1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_12/MatMul/ReadVariableOp", "shape": [1024, 1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_12/BiasAdd/ReadVariableOp", "shape": [1024], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_13/MatMul/ReadVariableOp", "shape": [1024, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_13/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_14/MatMul/ReadVariableOp", "shape": [512, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_14/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_15/MatMul/ReadVariableOp", "shape": [512, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_15/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_16/MatMul/ReadVariableOp", "shape": [256, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_16/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_17/MatMul/ReadVariableOp", "shape": [256, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/emis_abso/dense_17/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lambda/mul/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lambda/add/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lambda/mul_1/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lambda/add_1/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential/lambda/pow/y", "shape": [], "dtype": "float32"}]}]}